In [1]:
#!pip install gspread

In [4]:
import pandas as pd
import gspread

In [5]:
gc = gspread.service_account(filename = "C:\\Users\\TRISHA\\Downloads\\sheet-405411-2405c8be54b2.json")

In [6]:
gc

In [10]:
sheet = gc.open_by_url("https://docs.google.com/spreadsheets/d/1JdrX_AFQrYEw6rMrXGluMMP6zPVpwnq4iEIOli2dVMs/edit?usp=sharing")

In [11]:
sheet

In [27]:
male = sheet.worksheet('Male')

In [24]:
male

In [28]:
female = sheet.worksheet('Female')

In [29]:
female

In [32]:
dfmale = pd.DataFrame(male.get_all_records())

In [33]:
dfmale

    Name  Age
0   Abul   24
1  Habul   43
2  Kabul   21
3  Dabul   54
4  Mabul   35
5  Rabul   27

In [35]:
dffemale = pd.DataFrame(female.get_all_records())

In [36]:
dffemale

      Name  Age
0    joina   34
1  sokhina   32
2   hasina   26
3   morina   23